k = 'lizard'

# Введите ваше решение ниже
values = {
    'а': 1, 'в': 1, 'е': 1, 'и': 1, 'н': 1, 'о': 1, 'р': 1, 'с': 1, 'т': 1, 'a': 1, 'e': 1, 'i': 1, 'o': 1, 'u': 1, 'l': 1, 'n': 1, 's': 1, 't': 1, 'r': 1,
    'д': 2, 'к': 2, 'л': 2, 'м': 2, 'п': 2, 'у': 2, 'd': 2, 'g': 2,
    'б': 3, 'г': 3, 'ё': 3, 'ь': 3, 'я': 3, 'b': 3, 'c': 3, 'm': 3, 'p': 3,
    'й': 4, 'ы': 4, 'f': 4, 'h': 4, 'v': 4, 'w': 4, 'y': 4,
    'ж': 5, 'з': 5, 'х': 5, 'ц': 5, 'ч': 5, 'k': 5,
    'ш': 8, 'э': 8, 'ю': 8, 'j': 8, 'x': 8,
    'ф': 10, 'щ': 10, 'ъ': 10, 'q': 10, 'z': 10
}

count = 0
for element in k:
    if element in k:
        count += values.get(element, 0)
print(count)






